GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/mg323.c
	//rt_device_write( dev_uart, 0, buff, count );
	return ret;
}

/***********************************************************
* Function:		mg323_control
* Description:	控制模块
* Input:		rt_uint8_t cmd	命令类型
    void *arg       参数,依据cmd的不同，传递的数据格式不同
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t mg323_control( rt_device_t dev, rt_uint8_t cmd, void *arg )
{
	switch( cmd )
	{
		case CTL_STATUS:
			break;
		case CTL_AT_CMD: //发送at命令,结果要返回
			break;
		case CTL_PPP:
			break;
		case CTL_SOCKET:
			break;
	}
	return RT_EOK;
}

/*
   +CREG:0,1
   +CGREG:0,5
 */
rt_err_t RespFunc_CGREG( char *p, uint16_t len )
{
	uint32_t	i, n, code;
	rt_err_t	res = RT_EOK;
	i = sscanf( p, "%*[^:]:%d,%d", &n, &code );
	if( i != 2 )
	{
		return RT_ERROR;
	}
	if( ( code != 1 ) && ( code != 5 ) )
	{
		res = RT_ERROR;
	}
	return res;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_err_t RespFunc_COPS( char *p, uint16_t len )
{
/*
   char *oper=(char*)0;
   oper=strstr(p,"CHN-CUGSM");
   if(oper){
   strcpy((char*)sys_param.apn,"UNINET");
   return AT_RESP_OK;
   }
   oper=strstr(p,"CHINAMOBILE");
   if(oper){
   strcpy((char*)sys_param.apn,"CMNET");
   return AT_RESP_OK;
   }
 */
	return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_err_t RespFunc_CIFSR( char *p, uint16_t len )
{
	uint8_t		i	= 0;
	rt_err_t	res = RT_ERROR;
	int32_t		PARAM_LocalIP[4];
	i = sscanf( p, "%u.%d.%d.%d",
	            &( PARAM_LocalIP[0] ),
	            &( PARAM_LocalIP[1] ),
	            &( PARAM_LocalIP[2] ),
	            &( PARAM_LocalIP[3] ) );
	if( i == 4 )
	{
		res = RT_EOK;
	}
	return res;
}

/*
   SIM卡的IMSI号码为4600 00783208249，
      460 00 18 23 20 86 42

   接口号数据字段的内容为IMSI号码的后12位
   其6个字节的内容为 0x00 0x07 0x83 0x20 0x82 0x49

 */
rt_err_t RespFunc_CIMI( char *p, uint16_t len )
{
	rt_err_t	res = RT_ERROR;
	char		*pimsi, i;
	if( strlen( p ) < 15 )
	{
		return RT_ERROR;
	}
	if( strncmp( p, "460", 3 ) == 0 )
	{
		//strncpy(sys_param.imsi,p,15);
		res = RT_EOK;
	}
	return res;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_err_t RespFunc_CPIN( char *p, uint16_t len )
{
	rt_err_t	res = RT_ERROR;
	char		*pimsi, i;
	if( strlen( p ) < 15 )
	{
		return RT_ERROR;
	}
	if( strncmp( p, "460", 3 ) == 0 )
	{
		//strncpy(sys_param.imsi,p,15);
		res = RT_EOK;
	}
	return res;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:		+CSQ: 31, 99
* Return:
* Others:
***********************************************************/
rt_err_t RespFunc_CSQ( char *p, uint16_t len )
{
	rt_err_t	res = RT_ERROR;
	uint32_t	i, n, code;

	i = sscanf( p, "+CSQ%*[^:]:%d,%d", &n, &code );
	if(i!=2) return RT_ERROR;
	return RT_EOK;
}

/*等待固定信息的返回*/
rt_err_t WaitResp( char *resp, rt_tick_t ticks )
{
	rt_tick_t	start		= rt_tick_get( );
	rt_tick_t	localticks	= ticks;
	char		*p;
	rt_err_t	ret;

/*等待收到信息*/
lbl_waitresp_again:
	ret = rt_sem_take( &sem_gsmrx, localticks );
	if( ret == -RT_ETIMEOUT )
	{
		return ret;                                 //超时退出，没有数据或接收数据完毕
	}
	p = strstr( gsm_rx, resp );
	if( p )
	{
		return RT_EOK;                              /*找到了*/
	}
	/*没找到，继续等，这个信息如何处理?比如来短信的通知等URC*/
	localticks = start + ticks - rt_tick_get( );    /*计算剩余的时间*/
	if( localticks > 1 )
	{
		goto lbl_waitresp_again;
	}
	return RT_ETIMEOUT;
}

/*
   检查指定时间内的返回情况
   并调用专门的函数处理返回结果
 */
int8_t CheckResp( uint32_t ticks, RESP_FUNC resp_func )
{
	rt_tick_t	start		= rt_tick_get( );
	rt_tick_t	localticks	= ticks;
	rt_err_t	ret			= RT_EOK;
/*等待收到信息*/
lbl_checkresp_again:
	ret = rt_sem_take( &sem_gsmrx, localticks );
	if( ret == -RT_ETIMEOUT )
	{
		return ret;                      //超时退出，没有数据或接收数据完毕
	}
	/*收到信息，要判断是不是需要的*/
	ret = resp_func( gsm_rx, gsm_rx_wr );
	if( ret == RT_EOK )
	{
		return RT_EOK;
	}
	localticks = start + ticks - rt_tick_get( ); /*计算剩余的时间*/
	if( localticks > 1 )
	{
		goto lbl_checkresp_again;
	}
	return RT_ETIMEOUT;
}

/***********************************************************
* Function:		SendATCmdWaitRespStr
* Description:	发送命令，等待返回指定的字符串
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
int8_t SendATCmdWaitRespStr( char *atcmd,
                             uint32_t ticks,
                             char * respstring,
                             uint8_t no_of_attempts )
{
	rt_err_t	ret_val = RT_ERROR;
	uint8_t		i;

	for( i = 0; i < no_of_attempts; i++ )
	{
		mg323_write( dev_uart, 0, atcmd, strlen( atcmd ) );
		ret_val = WaitResp( respstring, ticks );
		if( ret_val == RT_EOK )
		{
			break;
		}
	}
	return ( ret_val );
}

/***********************************************************
* Function:		SendATCmdWaitRespFunc
* Description:	发送命令，并将返回结果调用指定的处理函数
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
int8_t SendATCmdWaitRespFunc( char *atcmd,
                              uint32_t ticks,
                              RESP_FUNC respfunc,
                              uint8_t no_of_attempts )
{
	int8_t	ret_val = RT_ERROR;
	uint8_t i;

	for( i = 0; i < no_of_attempts; i++ )
	{
		//printf("\r\n%d(waitrespfunc)>%s",OSTimeGet(),AT_cmd_string);
		mg323_write( dev_uart, 0, atcmd, strlen( atcmd ) );
		ret_val = CheckResp( ticks, respfunc );
		if( ret_val == RT_EOK )
		{
			break;
		}
	}
	return ( ret_val );
}

/***********************************************************
* Function:
* Description:	模块上电并完成AT命令初始化
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gsm_poweron( void* parameter )
{
	rt_err_t res;

/*此处可通过rt_thread_self获取线程信息*/
lbl_start_pwr_on:
	rt_kprintf( "\r\n%ld>gsm pwr on start", rt_tick_get( ) );
	GPIO_SetBits( GSM_PWR_PORT, GSM_PWR_PIN );
	rt_thread_delay( RT_TICK_PER_SECOND / 2 );  //500ms
	GPIO_SetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
	rt_thread_delay( RT_TICK_PER_SECOND / 10 ); //100ms
	GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
	rt_kprintf( "\r\n%ld>gsm pwr on end", rt_tick_get( ) );

