GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/mg323.c
	res = WaitResp( "^SYSSTART", RT_TICK_PER_SECOND * 10 );
	if( res != RT_EOK )
	{
		rt_kprintf( "\r\n%d>re gsm pwron\r\n", rt_tick_get( ) );
		goto lbl_start_pwr_on;
	}
	res = SendATCmdWaitRespStr( "AT\r\n", 3 * RT_TICK_PER_SECOND, "OK", 3 );
	res = SendATCmdWaitRespStr( "ATE0\r\n", 3 * RT_TICK_PER_SECOND, "OK", 3 );
	res = SendATCmdWaitRespStr( "ATV1\r\n", 3 * RT_TICK_PER_SECOND, "OK", 3 );
	res = SendATCmdWaitRespFunc( "AT+CPIN?\r\n", 3 * RT_TICK_PER_SECOND, RespFunc_CPIN, 3 );
	if( res != RT_EOK )
	{
		goto lbl_start_pwr_on;
	}
	res			= SendATCmdWaitRespFunc( "AT+COPS?\r\n", 3 * RT_TICK_PER_SECOND, RespFunc_COPS, 10 );
	res			= SendATCmdWaitRespFunc( "AT+CREG?\r\n", 3 * RT_TICK_PER_SECOND, RespFunc_CGREG, 10 );
	res			= SendATCmdWaitRespFunc( "AT+CIMI\r\n", 3 * RT_TICK_PER_SECOND, RespFunc_CIMI, 3 );
	res			= SendATCmdWaitRespFunc( "AT+CGREG?\r\n", 3 * RT_TICK_PER_SECOND, RespFunc_CGREG, 10 );
	res			= SendATCmdWaitRespStr( "AT+CGATT?\r\n", 3 * RT_TICK_PER_SECOND, "+CGATT:1", 10 );
	gsmstate	= GSM_AT; /*切换到AT状态*/
}

/***********************************************************
* Function:	rt_thread_entry_gsm_poweroff
* Description: 挂断当前链接，并关闭模块
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gsm_poweroff( void* parameter )
{
	rt_err_t res;

/*此处可通过rt_thread_self获取线程信息*/

/*关闭连接*/

/*模块断电*/
lbl_start_pwr_off:

	rt_kprintf( "\r\n%ld>gsm pwr off start", rt_tick_get( ) );
	GPIO_SetBits( GSM_PWR_PORT, GSM_PWR_PIN );
	rt_thread_delay( RT_TICK_PER_SECOND / 2 );  //500ms
	GPIO_SetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
	rt_thread_delay( RT_TICK_PER_SECOND / 10 ); //100ms
	GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );

	res = WaitResp( "^SHUTDOWN", RT_TICK_PER_SECOND * 10 );
	if( res != RT_EOK )
	{
		rt_kprintf( "\r\n%d>re gsm pwron\r\n", rt_tick_get( ) );
		goto lbl_start_pwr_off;
	}

	rt_kprintf( "\r\n%ld>gsm pwr off end", rt_tick_get( ) );
}

/***********************************************************
* Function:	rt_thread_entry_gsm_ppp
* Description: 建立链接
   可以只建立特定的链接，也可以建立全部的链接
* Input:		void* parameter
   建立的链接号  0:全部  尚未实现-考虑是否要取消
        非0:特定的链接号
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gsm_ppp( void* parameter )
{
	rt_err_t	ret;
	int			i;
	uint8_t		linkid = *(char*)parameter;
	char		buf[100];
	uint8_t		linkid_from = 0, linkid_to = MAX_SOCKETS;
	SendATCmdWaitRespFunc( "AT+COPS?", 20, RespFunc_COPS, 3 );

	sprintf( buf, "AT^SICS=%d,conType,GPRS0\r\n", i );
	SendATCmdWaitRespStr( buf, RT_TICK_PER_SECOND, "OK", 1 );
	sprintf( buf, "AT^SICS=%d,passwd,%s\r\n", i, gsm_apn.password );
	SendATCmdWaitRespStr( buf, RT_TICK_PER_SECOND, "OK", 1 );

	sprintf( buf, "AT^SICS=%d,user,%s\r\n", i, gsm_apn.user );
	SendATCmdWaitRespStr( buf, RT_TICK_PER_SECOND, "OK", 1 );

	sprintf( buf, "AT^SICS=%d,apn,%s\r\n", i, gsm_apn.apn );
	SendATCmdWaitRespStr( buf, RT_TICK_PER_SECOND, "OK", 1 );

	sprintf( buf, "AT^SISS=%d,srvType,socket\r\n", i );
	SendATCmdWaitRespStr( buf, RT_TICK_PER_SECOND, "OK", 1 );

	sprintf( buf, "AT^SISS=%d,srvType,socket\r\n", i );
	SendATCmdWaitRespStr( buf, RT_TICK_PER_SECOND, "OK", 1 );

	gsmstate = GSM_DATA;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gsm_send( void* parameter )
{
/*此处可通过rt_thread_self获取线程信息*/



}

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_stack[2048];
struct rt_thread thread_gsm;


/***********************************************************
* Function:       rt_thread_entry_gsm
* Description:    接收处理，状态转换
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gsm( void* parameter )
{
	rt_tick_t		curr_ticks;
	rt_err_t		res;
	unsigned char	ch, next;

/*gsm的状态切换*/
	curr_ticks = rt_tick_get( );
	switch( gsmstate )
	{
		case GSM_IDLE:
			break;
		case GSM_POWERON:                                   /*上电过程中，控制IO的操作放在此处，如何保证时间的可靠*/
			if( tid_gsm_subthread == RT_NULL )
			{
				tid_gsm_subthread = rt_thread_create( "pwron",
				                                      rt_thread_entry_gsm_poweron, (void*)1,
				                                      512,  /* thread stack size */
				                                      25,   /* thread priority */
				                                      5     /* thread time slice*/
				                                      );
				if( tid_gsm_subthread != RT_NULL )
				{
					rt_thread_startup( tid_gsm_subthread );
				}
			}
			break;
		case GSM_POWEROFF:                                  /*断电电过程中，控制IO的操作放在此处，如何保证时间的可靠*/
			if( tid_gsm_subthread == RT_NULL )
			{
				tid_gsm_subthread = rt_thread_create( "pwroff",
				                                      rt_thread_entry_gsm_poweroff, (void*)1,
				                                      512,  /* thread stack size */
				                                      25,   /* thread priority */
				                                      5     /* thread time slice*/
				                                      );
				if( tid_gsm_subthread != RT_NULL )
				{
					rt_thread_startup( tid_gsm_subthread );
				}
			}
			break;
		case GSM_AT:
			if( fConnectToGprs )
			{
				gsmstate = GSM_PPP; /*切换链接*/
			}
			break;
		case GSM_PPP:
			if( tid_gsm_subthread == RT_NULL )
			{
				tid_gsm_subthread = rt_thread_create( "ppp",
				                                      rt_thread_entry_gsm_ppp, (void*)1,
				                                      512,  /* thread stack size */
				                                      25,   /* thread priority */
				                                      5     /* thread time slice*/
				                                      );
				if( tid_gsm_subthread != RT_NULL )
				{
					rt_thread_startup( tid_gsm_subthread );
				}
			}
			break;
		case GSM_DATA:
			break;
	}

/*接收超时判断*/
	res = rt_sem_take( &sem_uart, RT_TICK_PER_SECOND / 10 );    //等待100ms,实际上就是变长的延时,最长100ms
	if( res == -RT_ETIMEOUT )                                   //超时退出，没有数据或接收数据完毕
	{
		if( gsm_rx_wr )
		{
			gsmrx_cb( gsm_rx, gsm_rx_wr );
			gsm_rx_wr = 0;
		}
	}else //收到数据,理论上1个字节触发一次,这里没有根据收到的<CRLF>处理，而是等到超时统一处理
	{
		while( rt_device_read( dev_uart, 0, &ch, 1 ) == 1 )
		{
			gsm_rx[gsm_rx_wr++] = ch;
			if( gsm_rx_wr == GSM_RX_SIZE )
			{
				gsm_rx_wr = 0;
			}
			gsm_rx[gsm_rx_wr] = 0;
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gsm_init( T_GSM_OPS *gsm_ops )
{
	rt_thread_t tid;

	rt_sem_init( &sem_uart, "sem_uart", 0, 0 );
	rt_sem_init( &sem_gsmrx, "sem_gsmrx", 0, 0 );

	rt_thread_init( &thread_gsm,
	                "gsm",
	                rt_thread_entry_gsm,
	                RT_NULL,
	                &thread_gsm_stack[0],
	                sizeof( thread_gsm_stack ), 7, 5 );
	rt_thread_startup( &thread_gsm );


